{
	"speakers": [
		{
			"name": "Miriam Beloglovsky, M.A.",
			"image": "Miriam Beloglovsky.png",
			"keynote": "friday",
			"description": "As a professor of early childhood education, sought-after public speaker, CEO of Playful Transformation, and author, Miriam Beloglovsky’s goal is to engage, inspire, and motivate audiences worldwide to explore the power of play and embrace play as a vehicle that transforms their life.  Miriam is the author of the “Loose Parts” book series, which showcases her advocacy for play with unscripted materials.\nMiriam’s keynote, Just Play: Rekindling Adult Creativity, delves into the dynamic tapestry of adulthood, where amidst our roles and responsibilities, the concept of 'play' often gets lost or dismissed as frivolous. Yet, \"Just Play\" is a testament to the profound importance of play in adult life, underscoring how it is beneficial and essential for fostering creativity, adaptiveness, and holistic well-being.\nPlay is not just an act; it's a state of being that can elevate every facet of life. By harnessing play's joy and unbound potential, adults can rediscover their childhood genius — the spark of transformation and creativity that can change the world. \"Just Play\" is more than a keynote; it's an invitation, a call to action for adults to reengage with their innate playful spirits, a quality we often attribute solely to childhood. This insightful workshop explores how play can catalyze transformational growth for both children and adults."
		},
		{
			"name": "Julie Nicholson, Ph.D, MBA",
			"image": "Julie Nicholson.jpg",
			"keynote": "saturday",
			"description": "Dr. Julie Nicholson is an early learning champion, a former preschool and kindergarten teacher, a parent of three daughters and a former parent and President of a Bay Area parent participation preschool. She was a Professor of Practice at Mills College in Oakland for 17 years where she directed several innovative programs including the Leadership Program in Early Childhood, a Joint MBA/MA Educational Leadership Program and the Center for Global Play Research. Dr. Nicholson is co-author of 13 books and many journal articles. Her most recent books include The Powerful Role of Play in Education and Creating Equitable Early Learning Environments for Young Boys of Color: Disrupting Disproportionate Outcomes (2023; both published by the California Department of Education), Principals as Early Learning Leaders: Effectively Supporting Our Youngest Learners (2022; Teachers College Press) and Supporting Young Children to Cope, Build Resilience and Heal from Trauma through Play: A Practical Guide (2023; Routledge). Her forthcoming book, Reducing Stress in Schools: Trauma-Responsive Strategies to Support Teachers and Students (2024, Harvard Education Press) is focused on PreK-12 teachers and administrators. Julie is currently the Vice President of Implementation and Impact at Children’s Funding Project. She regularly gives keynotes and provides professional development, coaching and mentoring to individuals, agencies, schools/districts, and state leadership teams across the U.S. She has extensive experience participating in policy committees, serving on non-profit Boards, and participating in international policy, research and practice-focused projects.\nDuring her keynote, Dr. Nicholson will guide us in celebrating the powerful role of play in supporting young children’s learning, development, and overall well-being. Weaving together authentic stories, contemporary research, and windows into high quality early learning environments, she will highlight the sights and sounds of powerful learning for preschool-aged children and the complex role of early childhood teachers and families who are entrusted to guide them during a critical time for their brain and body development. Participants will see developmentally informed early learning environments in action. Dr. Nicholson will inspire all of us to see our collective opportunity and responsibility to create inclusive, engaging, equitable and healing play-based environments for our youngest learners."
		}
	]
}
